In [1]:
import pandas as pd
import numpy as np

### Creating DataFrame

In [2]:
#Dict
states ={'State' :['Gujarat', 'Tamil Nadu', ' Andhra', 'Karnataka', 'Kerala'], 'Population': [36, 44, 67,89,34],'Language' :['Gujarati', 'Tamil', 'Telugu', 'Kannada', 'Malayalam']}

In [3]:
states

{'State': ['Gujarat', 'Tamil Nadu', ' Andhra', 'Karnataka', 'Kerala'],
 'Population': [36, 44, 67, 89, 34],
 'Language': ['Gujarati', 'Tamil', 'Telugu', 'Kannada', 'Malayalam']}

In [4]:
state_df=pd.DataFrame(states)

In [5]:
state_df

        State  Population   Language
0     Gujarat          36   Gujarati
1  Tamil Nadu          44      Tamil
2      Andhra          67     Telugu
3   Karnataka          89    Kannada
4      Kerala          34  Malayalam

In [6]:
print(type(state_df))

<class 'pandas.core.frame.DataFrame'>

In [7]:
#Getting individul column 
population=state_df["Population"]
#population=state_df.Population

In [8]:
population

0    36
1    44
2    67
3    89
4    34
Name: Population, dtype: int64

In [9]:
#Getting shape
state_df.shape

(5, 3)

In [10]:
#displaying descriptive information of dataframe
state_df.describe()
#Showing for only numerical data

       Population
count    5.000000
mean    54.000000
std     23.547824
min     34.000000
25%     36.000000
50%     44.000000
75%     67.000000
max     89.000000

In [17]:
#Display only key 
state_df.keys()
#tate_df.columns

Index(['State', 'Population', 'Language'], dtype='object')

In [18]:
#Display only index
state_df.index

RangeIndex(start=0, stop=5, step=1)

### Reading data from CSV and Excel File

In [20]:
mydata=pd.read_csv(r"C:/Users/SHUBH_RAM/Desktop/Tool_PPT/Ml_Data/Pandas_example_data/Edu-Data.csv")

#### Viewing your data

In [21]:
mydata.head()

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,raisedhands,VisITedResources,AnnouncementsView,Discussion,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
0,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,15,16,2,20,Yes,Good,Under-7,M
1,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,20,20,3,25,Yes,Good,Under-7,M
2,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,10,7,0,30,No,Bad,Above-7,L
3,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,30,25,5,35,No,Bad,Above-7,L
4,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,40,50,12,50,No,Bad,Above-7,M

In [22]:
mydata.tail()

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,raisedhands,VisITedResources,AnnouncementsView,Discussion,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
475,F,Jordan,Jordan,MiddleSchool,G-08,A,Chemistry,S,Father,5,4,5,8,No,Bad,Above-7,L
476,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,F,Father,50,77,14,28,No,Bad,Under-7,M
477,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,S,Father,55,74,25,29,No,Bad,Under-7,M
478,F,Jordan,Jordan,MiddleSchool,G-08,A,History,F,Father,30,17,14,57,No,Bad,Above-7,L
479,F,Jordan,Jordan,MiddleSchool,G-08,A,History,S,Father,35,14,23,62,No,Bad,Above-7,L

In [23]:
#Total number of row and column
mydata.shape

(480, 17)

In [28]:
#Printing total number of method for DataFrame
df_method=set(dir(pd.DataFrame))
print(len(df_method))

460

In [29]:
mydata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 480 entries, 0 to 479
Data columns (total 17 columns):
gender                      480 non-null object
NationalITy                 480 non-null object
PlaceofBirth                480 non-null object
StageID                     480 non-null object
GradeID                     480 non-null object
SectionID                   480 non-null object
Topic                       480 non-null object
Semester                    480 non-null object
Relation                    480 non-null object
raisedhands                 480 non-null int64
VisITedResources            480 non-null int64
AnnouncementsView           480 non-null int64
Discussion                  480 non-null int64
ParentAnsweringSurvey       480 non-null object
ParentschoolSatisfaction    480 non-null object
StudentAbsenceDays          480 non-null object
Class                       480 non-null object
dtypes: int64(4), object(13)
memory usage: 63.8+ KB

In [30]:
mydata.describe()

       raisedhands  VisITedResources  AnnouncementsView  Discussion
count   480.000000        480.000000         480.000000  480.000000
mean     46.775000         54.797917          37.918750   43.283333
std      30.779223         33.080007          26.611244   27.637735
min       0.000000          0.000000           0.000000    1.000000
25%      15.750000         20.000000          14.000000   20.000000
50%      50.000000         65.000000          33.000000   39.000000
75%      75.000000         84.000000          58.000000   70.000000
max     100.000000         99.000000          98.000000   99.000000

In [31]:
mydata.describe().T

                   count       mean        std  min    25%   50%   75%    max
raisedhands        480.0  46.775000  30.779223  0.0  15.75  50.0  75.0  100.0
VisITedResources   480.0  54.797917  33.080007  0.0  20.00  65.0  84.0   99.0
AnnouncementsView  480.0  37.918750  26.611244  0.0  14.00  33.0  58.0   98.0
Discussion         480.0  43.283333  27.637735  1.0  20.00  39.0  70.0   99.0

In [32]:
mydata.describe(include=[np.number],percentiles=[.01,.02,.03]).T

,count,mean,std,min,1%,2%,3%,50%,max
raisedhands,480.0,46.775000,30.779223,0.0,0.0,1.00,2.00,50.0,100.0
VisITedResources,480.0,54.797917,33.080007,0.0,0.0,2.00,2.00,65.0,99.0
AnnouncementsView,480.0,37.918750,26.611244,0.0,0.0,0.58,1.37,33.0,98.0
Discussion,480.0,43.283333,27.637735,1.0,2.0,3.00,4.00,39.0,99.0

### Basic statistics!

In [33]:
mydata.head(1)

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,raisedhands,VisITedResources,AnnouncementsView,Discussion,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
0,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,15,16,2,20,Yes,Good,Under-7,M

In [34]:
#Sum:To add all of the values in a particular column 
mydata["Discussion"].sum()

20776

In [35]:
#No missing Vlaue
mydata["Discussion"].sum(skipna=True)

20776

In [36]:
#Arithmetic mean
mydata["Discussion"].mean()

43.28333333333333

In [37]:
#Counting the number of values
mydata["gender"].count()

480

In [38]:
mydata["Discussion"].mean()

43.28333333333333

In [39]:
mydata["Discussion"].max()

99

In [40]:
mydata["Discussion"].min()

1

In [41]:
mydata.Discussion.median()

39.0

In [42]:
mydata.Discussion.mode()

0    70
dtype: int64

In [43]:
#Sample variance
mydata.Discussion.var()

763.8443980514961

In [44]:
#Sample standard deviation
mydata.Discussion.std()

27.637735038376356

In [45]:
#Skewness
mydata.skew()

raisedhands          0.026962
VisITedResources    -0.342441
AnnouncementsView    0.399243
Discussion           0.362594
dtype: float64

In [46]:
#Correlation 
mydata.corr()

,raisedhands,VisITedResources,AnnouncementsView,Discussion
raisedhands,1.000000,0.691572,0.643918,0.339386
VisITedResources,0.691572,1.000000,0.594500,0.243292
AnnouncementsView,0.643918,0.594500,1.000000,0.417290
Discussion,0.339386,0.243292,0.417290,1.000000

In [47]:
#Covariance
mydata.cov()

,raisedhands,VisITedResources,AnnouncementsView,Discussion
raisedhands,947.360543,704.142328,527.415919,288.704802
VisITedResources,704.142328,1094.286843,523.338453,222.431072
AnnouncementsView,527.415919,523.338453,708.158312,306.906159
Discussion,288.704802,222.431072,306.906159,763.844398

In [59]:
#Value_count
mydata.head(1)

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,raisedhands,VisITedResources,AnnouncementsView,Discussion,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
0,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,15,16,2,20,Yes,Good,Under-7,M

In [60]:
mydata.Topic.value_counts()

IT           95
French       65
Arabic       59
Science      51
English      45
Biology      30
Spanish      25
Chemistry    24
Geology      24
Quran        22
Math         21
History      19
Name: Topic, dtype: int64

In [61]:
mydata.Topic.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)

IT           95
French       65
Arabic       59
Science      51
English      45
Biology      30
Spanish      25
Chemistry    24
Geology      24
Quran        22
Math         21
History      19
Name: Topic, dtype: int64

In [63]:
mydata.Topic.value_counts(normalize=True, sort=True, ascending=True, dropna=True)

History      0.039583
Math         0.043750
Quran        0.045833
Geology      0.050000
Chemistry    0.050000
Spanish      0.052083
Biology      0.062500
English      0.093750
Science      0.106250
Arabic       0.122917
French       0.135417
IT           0.197917
Name: Topic, dtype: float64